#include "main.h"
volatile  float OutData[4]={0};//全局变量输出数据



/*************************************************************/
/*                      初始化锁相环  32M                       */
/*************************************************************/
void INIT_PLL_32(void) 
{
    CLKSEL &= 0x7f;       //set OSCCLK as sysclk
    PLLCTL &= 0x8F;       //Disable PLL circuit
    CRGINT &= 0xDF;
    
    #if(BUS_CLOCK == 40000000) 
      SYNR = 0x44;
    #elif(BUS_CLOCK == 32000000)
      SYNR = 0x43;     
    #elif(BUS_CLOCK == 24000000)
      SYNR = 0x42;
    #endif 

    REFDV = 0x81;         //PLLCLK=2×OSCCLK×(SYNR+1)/(REFDV+1)＝64MHz ,fbus=32M
    PLLCTL =PLLCTL|0x70;  //Enable PLL circuit
    asm NOP;
    asm NOP;
    while(!(CRGFLG&0x08)); //PLLCLK is Locked already
    CLKSEL |= 0x80;        //set PLLCLK as sysclk
}


 /*************************************************************************************************
** 函数名称: PLL_Init
** 功能描述: 时钟初始化函数
** 说明:     总线时钟选定 64M
************************************************************************************************/
void SetBusCLK_64M(void)
{   
    CLKSEL=0X00;				//disengage PLL to system
    PLLCTL_PLLON=1;			//turn on PLL
    
    SYNR =0xc0 | 0x07; 	// VCOFRQ[7:6];SYNDIV[5:0]
                        // fVCO= 2*fOSC*(SYNDIV + 1)/(REFDIV + 1)
                        // fPLL= fVCO/(2 × POSTDIV) 
                        // fBUS= fPLL/2 
                        // VCOCLK Frequency Ranges  VCOFRQ[7:6]
                        // 32MHz <= fVCO <= 48MHz    00
                        // 48MHz <  fVCO <= 80MHz    01
                        // Reserved                  10
                        // 80MHz <  fVCO <= 120MHz   11	
                        // 已知：fOSC=16m 按照上面的设置 SYNDIV=14  REFDIV=3 则 fVCO= 2*16*15/4 = 120m	
                        // 则 VCOFRQ[7:6]= 11     即   SYNR=0xc0 | 中0xc0的由来  
                        
    REFDV=0x80 | 0x01;   // REFFRQ[7:6];REFDIV[5:0]
                        // fREF=fOSC/(REFDIV + 1)
                        // REFCLK Frequency Ranges  REFFRQ[7:6]
                        // 1MHz <= fREF <=  2MHz       00
                        // 2MHz <  fREF <=  6MHz       01
                        // 6MHz <  fREF <= 12MHz       10
                        // fREF >  12MHz               11                         
                        // pllclock=2*osc*(1+SYNR)/(1+REFDV)=32MHz;
                        // 已知：fOSC=16m 按照上面的设置  REFDIV=3 则 fREF= 16/4 = 4m	
                        // 则 REFFRQ[7:6]= 01     即   REFDV=0x40 |中0x40的由来
    
    
    POSTDIV=0x00;       //pllclock=2*osc*(1+SYNR)/(1+REFDV)=128MHz;
    _asm(nop);          //BUS CLOCK=64M
    _asm(nop);
    while(!(CRGFLG_LOCK==1));	  //when pll is steady ,then use it;
    CLKSEL_PLLSEL =1;		        //engage PLL to system; 
}
/*************************************************************************************************
** 函数名称: PLL_Init
** 功能描述: 时钟初始化函数
** 说明:     总线时钟选定 80M
************************************************************************************************/
 void SetBusCLK_80M(void)
{
    CLKSEL=0X00;				//disengage PLL to system
    PLLCTL_PLLON=1;			//turn on PLL
    SYNR =0xc0 | 0x09;                        
    REFDV=0x80 | 0x01; 
    POSTDIV=0x00;       //pllclock=2*osc*(1+SYNR)/(1+REFDV)=160MHz;
    _asm(nop);          //BUS CLOCK=80M
    _asm(nop);
    while(CRGFLG_LOCK != 1);	  //when pll is steady ,then use it;
    CLKSEL_PLLSEL =1;		        //engage PLL to system;
}

/*************************************************************************************************
** 函数名称: PLL_Init
** 功能描述: 时钟初始化函数
** 说明:     总线时钟选定 80M
************************************************************************************************/
 
 void IO_init(void)
{
  DDRA= 0xff;  //TFT彩屏
  DDRM= 0x00;  //拨码开关
  DDRK= 0xff;  //二极管
//  DDRB= 0x00;  /
  PORTK_PK4=0;
  PORTK_PK5=0;

}






 /***************************************************************************************************
** 函数名称: 
** 功能描述: 中断优先级设置函数
** 说明:     
***************************************************************************************************/
 void Interrupt_Priority_Set(void)
  {
    INT_CFADDR=0xe0;  //Vpit 3.2.0 中断第7组、
    INT_CFDATA6=0x03;//设置PIT3优先级为3（高）
    INT_CFADDR=0xe0;
    INT_CFDATA7=0x02;//设置PIT2优先级为2（中）
    INT_CFADDR=0x70;
    INT_CFDATA5=0x01;//设置PIT0优先级为1（低）
  }
  

 /***************************************************************************************************
** 函数名称: PWM_init
** 功能描述: PWM初始化函数
** 说明:     01、23通道为电机   45通道为舵机
***************************************************************************************************/
void PWM_int(void) 

{
 
 PWME=0x00;
 PWMPRCLK=0x33;  //总系8分频，CLOCK A,B为8M
 PWMSCLA=0x01;   //SA的时钟二分频，频率为4M
 PWMSCLB=0x01;   //SB的时钟二分频，频率为4M
 
 PWMCTL_CON01=1; //01通道级联使用
 PWMPOL_PPOL1=1; //高电平翻转
 PWMCLK_PCLK1=1; //选择SA作为时钟源
 PWMCAE_CAE1=1;  //居中对齐
 PWMPER01=400;   //频率为10k
 PWMDTY01=0;    
 PWMCNT01=0x00;  //01级联后计数器清零
 PWME_PWME1=1 ;  //使能01通道
 
 PWMCTL_CON23=1; //23通道级联使用      
 PWMPOL_PPOL3=1; //高电平翻转
 PWMCLK_PCLK3=1; //选择SB作为时钟源
 PWMCAE_CAE3=1;  //居中对齐
 PWMPER23=400;   //频率为10k
 PWMDTY23=0;    
 PWMCNT23=0x00;  //23级联后计数器清零
 PWME_PWME3=1 ;  //使能23通道
 
 PWMCTL_CON45=1; //45通道级联使用     舵机
 PWMPOL_PPOL5=1; //高电平翻转
 PWMCLK_PCLK5=1; //选择SA作为时钟源
 PWMCAE_CAE5=1;  //居中对齐
 PWMPER45=400;   //频率为100Hz
 PWMDTY45=0;    
 PWMCNT45=0x00;  //45级联后计数器清零
 PWME_PWME5=1 ;  //使能45通道
 
 PWMCTL_CON67=1; //67通道级联使用
 PWMPOL_PPOL7=1; //高电平翻转
 PWMCLK_PCLK7=1; //选择SB作为时钟源
 PWMCAE_CAE7=1;  //居中对齐
 PWMPER67=400;   //频率为10k
 PWMDTY67=0;    
 PWMCNT67=0x00;  //67级联后计数器清零
 PWME_PWME7=1 ;  //使能67通道
 
}

 /***************************************************************************************************
** 函数名称: PIT_init
** 功能描述:PIT中断初始化函数
** 说明:     1ms定时
***************************************************************************************************/    
void PIT_Init_1ms(void) 
  {
   PITCFLMT=0x00;  //禁止使能PIT模块
   PITCE_PCE0=1;   //使能定时器通道0
   PITMUX=0x00;    //定时器通道0使用微定时基准0
   PITMTLD0=8-1;   //设置8位微定时装载寄存器0初值
   PITLD0=10000-1; //定时周期=（&PITMTLD0+1)*(&PITLD0+1)
   PITINTE=0x01;   //使能PIT定时器通道0中断
   PITCFLMT=0x80;  //使能PIT模块 
   }
  /***************************************************************************************************
** 函数名称: PIT_init
** 功能描述:PIT中断初始化函数
** 说明:     定时
***************************************************************************************************/ 
 
void PIT_Init(void) 
  {
   PITCFLMT=0x00;  //禁止使能PIT模块
   PITCE_PCE0=1;   //使能定时器通道0
   PITMUX=0x00;    //定时器通道0使用微定时基准0
   PITMTLD0=64-1;   //设置8位微定时装载寄存器0初值
   PITLD0=1000-1; //定时周期=（&PITMTLD0+1)*(&PITLD0+1)
   PITINTE=0x01;   //使能PIT定时器通道0中断
   PITCFLMT=0x80;  //使能PIT模块 
   }  
   
/***********************************************************************************************
** 函数名称: TIM_Init
** 功能描述: 行场中断初始化函数
** 说明:     行中断上升沿触发  场中断下降沿触发
***************************************************************************************************/
void TIM_Init(void) 
{
TIOS =0x00;        //定时器通道0，1 为输入捕捉
TSCR1=0x80;        //定时器使能
TCTL4=0x09;        //通道0 捕捉上升沿通道1 捕捉下降沿
TIE=0x03;          //通道0，1 中断使能
TFLG1=0xFF;        //清中断标志位
}
/**********************************************************************************
函数名: void TimInit (void)  
功能:   脉冲累加器初始化
参数:   无
返回值: 无  P7口
***********************************************************************************/ 
void TimInit (void) 
{
 
 PACTL=0X00;
 PACNT=0X0000;//设置脉冲累加器初值
 PACTL_PAEN=1;
}

/***************************************************************************************************
** 函数名称: SCI_init
** 功能描述: 串口初始化函数
** 说明:    
***************************************************************************************************/

  void SCI_Init_9600(void) 

{ 
  SCI0BD=416;              //9600bps     波特率=总线时钟/(16*SCIBD) 

  SCI0CR1=0;              //正常8 位模式，无奇偶校验 
  SCI0CR2=0X2C;           //发送允许  接受中断允许 
} 
/***************************************************************************************************
** 函数名称: SCI_init
** 功能描述: 串口初始化函数
** 说明:    
***************************************************************************************************/

  void SCI_Init_115200(void) 

{ 
  SCI0BD=17;              //9600bps     波特率=总线时钟/(16*SCIBD) 

  SCI0CR1=0;              //正常8 位模式，无奇偶校验 
  SCI0CR2=0X2C;           //发送允许  接受中断允许 
} 


/***************************************************************************************************
** 函数名称: yejin_init
** 功能描述: TFT液晶屏初始化函数
** 说明:     
***************************************************************************************************/
void TFT_Init(void)

{

   ILI9163_RESET=0;                                
	delay(50);
	ILI9163_RESET=1;                     
	delay(100); 
	ILI9163B_init();
	delay(20); 
   
}
 /***************************************************************************************************
** 函数名称: init_all
** 功能描述: 初始化所有函数
** 说明:     
***************************************************************************************************/
 void Init_all(void)
 
 {
 // INIT_PLL_32();                   
  SetBusCLK_64M(); 
  //SetBusCLK_80M();     
  PIT_Init_1ms(); 
  
   IO_init();
   
 // TIM_Init();
 //Interrupt_Priority_Set();
 //TimInit ();
  PWM_int();
   TFT_Init();
   KB_Init(); //键盘初始化
   

 // SCI_Init_9600(); 
// SCI_Init_115200();
  // NRF24L01Int();
 }

#pragma CODE_SEG __NEAR_SEG NON_BANKED
